from fastHan import FastHan

model = FastHan('large')
text_array = [
    "昔商家至盤庚五遷。",
    "周室迨成王三徙。",
    "豈三代之數君徇于己私。",
    "妄自遷徙。",
    "以其圖大宅中。",
    "爲億萬世子孫之計。",
    "上謹天命。",
    "下因民志。",
    "苟有便輒改。",
    "故國祚延長。",
    "風俗富阜。",
    "而丁黎二家。",
    "乃徇己私。",
    "忽天命。",
    "罔蹈商周之迹。",
    "常安厥邑于茲。",
    "致世代弗長。",
    "筭數短促。",
    "百姓耗損。",
    "萬物失宜。",
    "朕甚痛之。",
    "不得不徙。",
    "况高王故都大羅城。",
    "宅天地區域之中。",
    "得龍蟠虎踞之勢。",
    "正南北東西之位。",
    "便江山向背之宜。",
    "其地廣而坦平。",
    "厥土高而爽塏。",
    "民居蔑昏墊之困。",
    "萬物極繁阜之豐。",
    "遍覽越邦。",
    "斯爲勝地。",
    "誠四方輻輳之要會。",
    "爲萬世帝王之上都。",
    "朕欲因此地利以定厥居。",
    "卿等如何？"
]

print(model(text_array))
print(model(text_array, target="Parsing"))
print(model(text_array, target="NER"))
